In [6]:
#Install Pandas
import pandas as pd

In [7]:
#create a list of data 
data = [1, 2, 3, 4, 5]

In [8]:
data

[1, 2, 3, 4, 5]

In [9]:
type(data)

list

In [14]:
#create a series from a list
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
type(s)

pandas.core.series.Series

In [18]:
#create a dataframe from a series #Set colomun name
df = pd.DataFrame(s,columns = ['num'])
df

   num
0    1
1    2
2    3
3    4
4    5

In [19]:
#create a series from a dataframe
s1 = df['num']
s1

0    1
1    2
2    3
3    4
4    5
Name: num, dtype: int64

In [20]:
#create a dictonary 
data = {
    'Name' : ['Rafiq', 'Raha', 'Rayhan'],
    'Age' : [23, 12, 15],
    'City' : ['Dhaka', "Feni", 'Comilla']
}
data

{'Name': ['Rafiq', 'Raha', 'Rayhan'],
 'Age': [23, 12, 15],
 'City': ['Dhaka', 'Feni', 'Comilla']}

In [22]:
#create a dataframe from a dictonary
df = pd.DataFrame(data)
df

     Name  Age     City
0   Rafiq   23    Dhaka
1    Raha   12     Feni
2  Rayhan   15  Comilla

In [23]:
#create a set
set = {12, 25, 54}
set

{12, 25, 54}

In [30]:
#create a series from a set #Required convert to list
s = pd.Series(list(set))
s

0    25
1    12
2    54
dtype: int64

In [29]:
#create a dataframe from a set 
df = pd.DataFrame(set)
df

    0
0  25
1  12
2  54

In [27]:
#create a tuple 
tuple = (12, 23, 48)
tuple

(12, 23, 48)

In [28]:
#create a series from a tuple
s = pd.Series(tuple)
s

0    12
1    23
2    48
dtype: int64

In [31]:
#create a dataframe from a tuple 
df = pd.DataFrame(tuple)
df

    0
0  12
1  23
2  48